---
kind: type
id: T:Autodesk.Revit.DB.AXMImportOptions
source: html/fa5c85e0-25ea-cc04-2b97-48a3fa989cfc.htm
---
# Autodesk.Revit.DB.AXMImportOptions

The import options used to import AXM format files.

## Syntax (C#)
```csharp
public class AXMImportOptions : BaseImportOptions
```